LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_rcc.h
/**
  ******************************************************************************
  * @file    gd32f20x_rcc.h
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   RCC header file of the firmware library.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GD32F20X_RCC_H
#define __GD32F20X_RCC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "gd32f20x.h"

/** @addtogroup GD32F20x_Firmware
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/** @defgroup RCC_Exported_Types
  * @{
  */

/** 
  * @brief  RCC Initial Parameters
  */

typedef struct
{
  uint32_t CK_SYS_Frequency;             /*!< The frequency of the CK_SYS.     */
  uint32_t AHB_Frequency;                /*!< The frequency of the AHB.        */
  uint32_t APB1_Frequency;              /*!< The frequency of the APB1.       */
  uint32_t APB2_Frequency;              /*!< The frequency of the APB2.       */
  uint32_t ADCCLK_Frequency;            /*!< The frequency of the ADCCLK.     */
}RCC_ClocksPara;

/**
  * @}
  */

/** @defgroup RCC_Exported_Constants
  * @{
  */

/** @defgroup RCC_HSE_configuration 
  * @{
  */

#define RCC_HSE_OFF                      ((uint32_t)0x00000000)
#define RCC_HSE_ON                       RCC_GCCR_HSEEN
#define RCC_HSE_BYPASS                   RCC_GCCR_HSEEN | RCC_GCCR_HSEBPS

/**
  * @}
  */ 

/** @defgroup RCC_PLL_input_clock_source 
  * @{
  */

#define RCC_PLLSOURCE_HSI_DIV2           RCC_GCFGR_PLLSEL_HSI_DIV2
#define RCC_PLLSOURCE_PREDIV1            RCC_GCFGR_PLLSEL_PREDIV1

/**
  * @}
  */ 

/** @defgroup RCC_PLL_Multiplication_factor 
  * @{
  */
#define  RCC_PLLMUL_2                         RCC_GCFGR_PLLMF2
#define  RCC_PLLMUL_3                         RCC_GCFGR_PLLMF3
#define  RCC_PLLMUL_4                         RCC_GCFGR_PLLMF4
#define  RCC_PLLMUL_5                         RCC_GCFGR_PLLMF5
#define  RCC_PLLMUL_6                         RCC_GCFGR_PLLMF6
#define  RCC_PLLMUL_7                         RCC_GCFGR_PLLMF7
#define  RCC_PLLMUL_8                         RCC_GCFGR_PLLMF8
#define  RCC_PLLMUL_9                         RCC_GCFGR_PLLMF9
#define  RCC_PLLMUL_10                        RCC_GCFGR_PLLMF10
#define  RCC_PLLMUL_11                        RCC_GCFGR_PLLMF11
#define  RCC_PLLMUL_12                        RCC_GCFGR_PLLMF12
#define  RCC_PLLMUL_13                        RCC_GCFGR_PLLMF13
#define  RCC_PLLMUL_14                        RCC_GCFGR_PLLMF14

#define  RCC_PLLMUL_16                        RCC_GCFGR_PLLMF16
#define  RCC_PLLMUL_17                        RCC_GCFGR_PLLMF17
#define  RCC_PLLMUL_18                        RCC_GCFGR_PLLMF18
#define  RCC_PLLMUL_19                        RCC_GCFGR_PLLMF19
#define  RCC_PLLMUL_20                        RCC_GCFGR_PLLMF20
#define  RCC_PLLMUL_21                        RCC_GCFGR_PLLMF21
#define  RCC_PLLMUL_22                        RCC_GCFGR_PLLMF22
#define  RCC_PLLMUL_23                        RCC_GCFGR_PLLMF23
#define  RCC_PLLMUL_24                        RCC_GCFGR_PLLMF24
#define  RCC_PLLMUL_25                        RCC_GCFGR_PLLMF25
#define  RCC_PLLMUL_26                        RCC_GCFGR_PLLMF26
#define  RCC_PLLMUL_27                        RCC_GCFGR_PLLMF27
#define  RCC_PLLMUL_28                        RCC_GCFGR_PLLMF28
#define  RCC_PLLMUL_29                        RCC_GCFGR_PLLMF29
#define  RCC_PLLMUL_30                        RCC_GCFGR_PLLMF30
#define  RCC_PLLMUL_31                        RCC_GCFGR_PLLMF31
#define  RCC_PLLMUL_32                        RCC_GCFGR_PLLMF32
#define  RCC_PLLMUL_6_5                       RCC_GCFGR_PLLMF6_5

/**
  * @}
  */

/** @defgroup RCC_PREDIV1_division_factor
  * @{
  */

#define  RCC_PREDIV1_DIV1               RCC_GCFGR2_PREDV1_DIV1
#define  RCC_PREDIV1_DIV2               RCC_GCFGR2_PREDV1_DIV2
#define  RCC_PREDIV1_DIV3               RCC_GCFGR2_PREDV1_DIV3
#define  RCC_PREDIV1_DIV4               RCC_GCFGR2_PREDV1_DIV4
#define  RCC_PREDIV1_DIV5               RCC_GCFGR2_PREDV1_DIV5
#define  RCC_PREDIV1_DIV6               RCC_GCFGR2_PREDV1_DIV6
#define  RCC_PREDIV1_DIV7               RCC_GCFGR2_PREDV1_DIV7
#define  RCC_PREDIV1_DIV8               RCC_GCFGR2_PREDV1_DIV8
#define  RCC_PREDIV1_DIV9               RCC_GCFGR2_PREDV1_DIV9
#define  RCC_PREDIV1_DIV10              RCC_GCFGR2_PREDV1_DIV10
#define  RCC_PREDIV1_DIV11              RCC_GCFGR2_PREDV1_DIV11
#define  RCC_PREDIV1_DIV12              RCC_GCFGR2_PREDV1_DIV12
#define  RCC_PREDIV1_DIV13              RCC_GCFGR2_PREDV1_DIV13
#define  RCC_PREDIV1_DIV14              RCC_GCFGR2_PREDV1_DIV14
#define  RCC_PREDIV1_DIV15              RCC_GCFGR2_PREDV1_DIV15
#define  RCC_PREDIV1_DIV16              RCC_GCFGR2_PREDV1_DIV16

/**
  * @}
  */


/** @defgroup RCC_PREDIV1_clock_source
  * @{
  */

#define  RCC_PREDIV1_SOURCE_HSE         RCC_GCFGR2_PREDV1SEL_HSE 
#define  RCC_PREDIV1_SOURCE_PLL2        RCC_GCFGR2_PREDV1SEL_PLL2 

/**
  * @}
  */


/** @defgroup RCC_PREDIV2_division_factor
  * @{
  */ 
#define  RCC_PREDIV2_DIV1               RCC_GCFGR2_PREDV2_DIV1
#define  RCC_PREDIV2_DIV2               RCC_GCFGR2_PREDV2_DIV2
#define  RCC_PREDIV2_DIV3               RCC_GCFGR2_PREDV2_DIV3
#define  RCC_PREDIV2_DIV4               RCC_GCFGR2_PREDV2_DIV4
#define  RCC_PREDIV2_DIV5               RCC_GCFGR2_PREDV2_DIV5
#define  RCC_PREDIV2_DIV6               RCC_GCFGR2_PREDV2_DIV6
#define  RCC_PREDIV2_DIV7               RCC_GCFGR2_PREDV2_DIV7
#define  RCC_PREDIV2_DIV8               RCC_GCFGR2_PREDV2_DIV8
#define  RCC_PREDIV2_DIV9               RCC_GCFGR2_PREDV2_DIV9
#define  RCC_PREDIV2_DIV10              RCC_GCFGR2_PREDV2_DIV10
#define  RCC_PREDIV2_DIV11              RCC_GCFGR2_PREDV2_DIV11
#define  RCC_PREDIV2_DIV12              RCC_GCFGR2_PREDV2_DIV12
#define  RCC_PREDIV2_DIV13              RCC_GCFGR2_PREDV2_DIV13
#define  RCC_PREDIV2_DIV14              RCC_GCFGR2_PREDV2_DIV14
#define  RCC_PREDIV2_DIV15              RCC_GCFGR2_PREDV2_DIV15
#define  RCC_PREDIV2_DIV16              RCC_GCFGR2_PREDV2_DIV16

/**
  * @}
  */


/** @defgroup RCC_PLL2_multiplication_factor
  * @{
  */ 
#define  RCC_PLL2MUL_8                  RCC_GCFGR2_PLL2MF8
#define  RCC_PLL2MUL_9                  RCC_GCFGR2_PLL2MF9
#define  RCC_PLL2MUL_10                 RCC_GCFGR2_PLL2MF10
#define  RCC_PLL2MUL_11                 RCC_GCFGR2_PLL2MF11
#define  RCC_PLL2MUL_12                 RCC_GCFGR2_PLL2MF12
#define  RCC_PLL2MUL_13                 RCC_GCFGR2_PLL2MF13
#define  RCC_PLL2MUL_14                 RCC_GCFGR2_PLL2MF14
#define  RCC_PLL2MUL_16                 RCC_GCFGR2_PLL2MF16
#define  RCC_PLL2MUL_20                 RCC_GCFGR2_PLL2MF20

/**
  * @}
  */


/** @defgroup RCC_PLL3_multiplication_factor
  * @{
  */
#define  RCC_PLL3MUL_8                  RCC_GCFGR2_PLL3MF8
#define  RCC_PLL3MUL_9                  RCC_GCFGR2_PLL3MF9
#define  RCC_PLL3MUL_10                 RCC_GCFGR2_PLL3MF10
#define  RCC_PLL3MUL_11                 RCC_GCFGR2_PLL3MF11
#define  RCC_PLL3MUL_12                 RCC_GCFGR2_PLL3MF12
#define  RCC_PLL3MUL_13                 RCC_GCFGR2_PLL3MF13
#define  RCC_PLL3MUL_14                 RCC_GCFGR2_PLL3MF14
#define  RCC_PLL3MUL_16                 RCC_GCFGR2_PLL3MF16
#define  RCC_PLL3MUL_20                 RCC_GCFGR2_PLL3MF20

/**
  * @}
  */


/** @defgroup RCC_System_Clock_Source 
  * @{
  */
#define  RCC_SYSCLKSOURCE_HSI                RCC_GCFGR_SCS_HSI
#define  RCC_SYSCLKSOURCE_HSE                RCC_GCFGR_SCS_HSE
#define  RCC_SYSCLKSOURCE_PLLCLK             RCC_GCFGR_SCS_PLL

/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source
  * @{
  */
#define  RCC_SYSCLK_DIV1                     RCC_GCFGR_AHBPS_DIV1
#define  RCC_SYSCLK_DIV2                     RCC_GCFGR_AHBPS_DIV2
#define  RCC_SYSCLK_DIV4                     RCC_GCFGR_AHBPS_DIV4
#define  RCC_SYSCLK_DIV8                     RCC_GCFGR_AHBPS_DIV8
#define  RCC_SYSCLK_DIV16                    RCC_GCFGR_AHBPS_DIV16
#define  RCC_SYSCLK_DIV64                    RCC_GCFGR_AHBPS_DIV64
#define  RCC_SYSCLK_DIV128                   RCC_GCFGR_AHBPS_DIV128
#define  RCC_SYSCLK_DIV256                   RCC_GCFGR_AHBPS_DIV256
#define  RCC_SYSCLK_DIV512                   RCC_GCFGR_AHBPS_DIV512

/**
  * @}
  */ 

/** @defgroup RCC_APB_Clock_Source
  * @{
  */
#define  RCC_APB1AHB_DIV1                    RCC_GCFGR_APB1PS_DIV1
#define  RCC_APB1AHB_DIV2                    RCC_GCFGR_APB1PS_DIV2
#define  RCC_APB1AHB_DIV4                    RCC_GCFGR_APB1PS_DIV4
#define  RCC_APB1AHB_DIV8                    RCC_GCFGR_APB1PS_DIV8
#define  RCC_APB1AHB_DIV16                   RCC_GCFGR_APB1PS_DIV16

#define  RCC_APB2AHB_DIV1                    RCC_GCFGR_APB2PS_DIV1
#define  RCC_APB2AHB_DIV2                    RCC_GCFGR_APB2PS_DIV2
#define  RCC_APB2AHB_DIV4                    RCC_GCFGR_APB2PS_DIV4
#define  RCC_APB2AHB_DIV8                    RCC_GCFGR_APB2PS_DIV8
#define  RCC_APB2AHB_DIV16                   RCC_GCFGR_APB2PS_DIV16
/**
  * @}
  */

/** @defgroup RCC_ADC_clock_source 
  * @{
  */
#define  RCC_ADCCLK_APB2_DIV2                RCC_GCFGR_ADCPS_DIV2
#define  RCC_ADCCLK_APB2_DIV4                RCC_GCFGR_ADCPS_DIV4
#define  RCC_ADCCLK_APB2_DIV6                RCC_GCFGR_ADCPS_DIV6
#define  RCC_ADCCLK_APB2_DIV8                RCC_GCFGR_ADCPS_DIV8
#define  RCC_ADCCLK_APB2_DIV12               RCC_GCFGR_ADCPS_DIV12
#define  RCC_ADCCLK_APB2_DIV16               RCC_GCFGR_ADCPS_DIV16

/**
  * @}
  */

/** @defgroup RCC_USB_OTG_clock_source 
  * @{
  */
#define  RCC_OTGCLK_PLL_DIV1                RCC_GCFGR_OTGFSPS_Div1
#define  RCC_OTGCLK_PLL_DIV1_5              RCC_GCFGR_OTGFSPS_Div1_5
#define  RCC_OTGCLK_PLL_DIV2                RCC_GCFGR_OTGFSPS_Div2
#define  RCC_OTGCLK_PLL_DIV2_5              RCC_GCFGR_OTGFSPS_Div2_5

/**
  * @}
  */


