LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_rcc.h
/** @defgroup RCC_CK_OUT_Clock_Source
  * @{
  */
#define  RCC_CKOUTSRC_NOCLOCK               RCC_GCFGR_CKOUTSEL_NoClock
#define  RCC_CKOUTSRC_SYSCLK                RCC_GCFGR_CKOUTSEL_SYSCLK
#define  RCC_CKOUTSRC_HSI                   RCC_GCFGR_CKOUTSEL_HSI
#define  RCC_CKOUTSRC_HSE                   RCC_GCFGR_CKOUTSEL_HSE
#define  RCC_CKOUTSRC_PLLCLK_DIV2           RCC_GCFGR_CKOUTSEL_PLL_DIV2
#define  RCC_CKOUTSRC_PLL2CLK               RCC_GCFGR_CKOUTSEL_PLL2
#define  RCC_CKOUTSRC_PLL3CLK               RCC_GCFGR_CKOUTSEL_PLL3
#define  RCC_CKOUTSRC_PLL3CLK_DIV2          RCC_GCFGR_CKOUTSEL_PLL3_DIV2
#define  RCC_CKOUTSRC_EXT1                  RCC_GCFGR_CKOUTSEL_EXT1

/**
  * @}
  */

/** @defgroup RCC_Interrupt_Source
  * @{
  */
#define  RCC_INT_LSISTB                      ((uint32_t)0x00000001)
#define  RCC_INT_LSESTB                      ((uint32_t)0x00000002)
#define  RCC_INT_HSISTB                      ((uint32_t)0x00000004)
#define  RCC_INT_HSESTB                      ((uint32_t)0x00000008)
#define  RCC_INT_PLLSTB                      ((uint32_t)0x00000010)
#define  RCC_INT_PLL2STB                     ((uint32_t)0x00000020)
#define  RCC_INT_PLL3STB                     ((uint32_t)0x00000040)
#define  RCC_INT_CKM                         ((uint32_t)0x00000080)
#define  RCC_INT_PLLTSTB                     ((uint32_t)0x10000040)

/**
  * @}
  */

/** @defgroup RCC_I2S2_clock_source 
  * @{
  */
#define  RCC_I2S2CLK_SYSCLK        RCC_GCFGR2_I2S2SEL_CK_SYS
#define  RCC_I2S2CLK_PLL3          RCC_GCFGR2_I2S2SEL_PLL3

/**
  * @}
  */

/** @defgroup RCC_I2S3_clock_source 
  * @{
  */
#define  RCC_I2S3CLK_SYSCLK        RCC_GCFGR2_I2S3SEL_CK_SYS
#define  RCC_I2S3CLK_PLL3          RCC_GCFGR2_I2S3SEL_PLL3

/**
  * @}
  */

/** @defgroup RCC_LSE_configuration 
  * @{
  */
#define RCC_LSE_OFF                         ((uint32_t)0x00000000)
#define RCC_LSE_EN                           RCC_BDCR_LSEEN
#define RCC_LSE_BYPASS                      ((uint32_t)(RCC_BDCR_LSEEN | RCC_BDCR_LSEBPS))

/**
  * @}
  */

/** @defgroup RCC_LSE_oscillator_drive_capability 
  * @{
  */
#define RCC_LSEDRV_LOW                      ((uint32_t)0x00000000)
#define RCC_LSEDRV_MEDIUM_LOW               ((uint32_t)0x00000008)
#define RCC_LSEDRV_MEDIUM_HIGH              ((uint32_t)0x00000010)
#define RCC_LSEDRV_HIGH                     ((uint32_t)0x00000018)
/**
  * @}
  */

/** @defgroup RCC_RTC_clock_source 
  * @{
  */
#define RCC_RTCCLKSOURCE_LSE             RCC_BDCR_RTCSEL_LSE
#define RCC_RTCCLKSOURCE_LSI             RCC_BDCR_RTCSEL_LSI
#define RCC_RTCCLKSOURCE_HSE_DIV128      RCC_BDCR_RTCSEL_HSE128

/**
  * @}
  */

/** @defgroup RCC_AHB_peripheral 
  * @{
  */
#define  RCC_AHBPERIPH_DMA1               RCC_AHBCCR_DMA1EN
#define  RCC_AHBPERIPH_DMA2               RCC_AHBCCR_DMA2EN
#define  RCC_AHBPERIPH_SRAM               RCC_AHBCCR_SRAMEN
#define  RCC_AHBPERIPH_FMC                RCC_AHBCCR_FMCEN 
#define  RCC_AHBPERIPH_CRC                RCC_AHBCCR_CRCEN    
#define  RCC_AHBPERIPH_EXMC               RCC_AHBCCR_EXMCEN
#define  RCC_AHBPERIPH_SDIO               RCC_AHBCCR_SDIOEN
#define  RCC_AHBPERIPH_OTG_FS             RCC_AHBCCR_OTGFSEN        
#define  RCC_AHBPERIPH_ETH_MAC            RCC_AHBCCR_ETHMACEN       
#define  RCC_AHBPERIPH_ETH_MAC_RX         RCC_AHBCCR_ETHMACRXEN   
#define  RCC_AHBPERIPH_ETH_MAC_TX         RCC_AHBCCR_ETHMACTXEN     

/**
  * @}
  */

/** @defgroup RCC_AHB_Peripherals_RST 
  * @{
  */
#define  RCC_AHBPERIPH_OTGFSRST          RCC_AHBRCR_OTGFSRST
#define  RCC_AHBPERIPH_ETHMACRST         RCC_AHBRCR_ETHMACRST

/**
  * @}
  */


/** @defgroup RCC_APB2_peripheral 
  * @{
  */
#define  RCC_APB2PERIPH_AF                RCC_APB2CCR_AFEN
#define  RCC_APB2PERIPH_GPIOA             RCC_APB2CCR_PAEN    
#define  RCC_APB2PERIPH_GPIOB             RCC_APB2CCR_PBEN             
#define  RCC_APB2PERIPH_GPIOC             RCC_APB2CCR_PCEN        
#define  RCC_APB2PERIPH_GPIOD             RCC_APB2CCR_PDEN          
#define  RCC_APB2PERIPH_GPIOE             RCC_APB2CCR_PEEN        
#define  RCC_APB2PERIPH_GPIOF             RCC_APB2CCR_PFEN
#define  RCC_APB2PERIPH_GPIOG             RCC_APB2CCR_PGEN
#define  RCC_APB2PERIPH_ADC1              RCC_APB2CCR_ADC1EN  
#define  RCC_APB2PERIPH_ADC2              RCC_APB2CCR_ADC2EN   
#define  RCC_APB2PERIPH_TIMER1            RCC_APB2CCR_TIMER1EN  
#define  RCC_APB2PERIPH_SPI1              RCC_APB2CCR_SPI1EN   
#define  RCC_APB2PERIPH_TIMER8            RCC_APB2CCR_TIMER8EN     
#define  RCC_APB2PERIPH_USART1            RCC_APB2CCR_USART1EN     
#define  RCC_APB2PERIPH_ADC3              RCC_APB2CCR_ADC3EN     
#define  RCC_APB2PERIPH_TIMER9            RCC_APB2CCR_TIMER9EN   
#define  RCC_APB2PERIPH_TIMER10           RCC_APB2CCR_TIMER10EN  
#define  RCC_APB2PERIPH_TIMER11           RCC_APB2CCR_TIMER11EN    

/**
  * @}
  */ 

 
/** @defgroup RCC_APB2_Peripherals_RST 
  * @{
  */
#define  RCC_APB2PERIPH_AFRST             RCC_APB2RCR_AFRST
#define  RCC_APB2PERIPH_GPIOARST          RCC_APB2RCR_PARST
#define  RCC_APB2PERIPH_GPIOBRST          RCC_APB2RCR_PBRST
#define  RCC_APB2PERIPH_GPIOCRST          RCC_APB2RCR_PCRST
#define  RCC_APB2PERIPH_GPIODRST          RCC_APB2RCR_PDRST
#define  RCC_APB2PERIPH_GPIOERST          RCC_APB2RCR_PERST
#define  RCC_APB2PERIPH_GPIOFRST          RCC_APB2RCR_PFRST
#define  RCC_APB2PERIPH_GPIOGRST          RCC_APB2RCR_PGRST
#define  RCC_APB2PERIPH_ADC1RST           RCC_APB2RCR_ADC1RST
#define  RCC_APB2PERIPH_ADC2RST           RCC_APB2RCR_ADC2RST
#define  RCC_APB2PERIPH_TIMER1RST         RCC_APB2RCR_TIMER1RST
#define  RCC_APB2PERIPH_SPI1RST           RCC_APB2RCR_SPI1RST
#define  RCC_APB2PERIPH_TIMER8RST         RCC_APB2RCR_TIMER8RST
#define  RCC_APB2PERIPH_USART1RST         RCC_APB2RCR_USART1RST
#define  RCC_APB2PERIPH_ADC3RST           RCC_APB2RCR_ADC3RST
#define  RCC_APB2PERIPH_TIMER9RST         RCC_APB2RCR_TIMER9RST
#define  RCC_APB2PERIPH_TIMER10RST        RCC_APB2RCR_TIMER10RST
#define  RCC_APB2PERIPH_TIMER11RST        RCC_APB2RCR_TIMER11RST

/**
  * @}
  */


/** @defgroup RCC_APB1_peripheral 
  * @{
  */
#define  RCC_APB1PERIPH_TIMER2            RCC_APB1CCR_TIMER2EN
#define  RCC_APB1PERIPH_TIMER3            RCC_APB1CCR_TIMER3EN
#define  RCC_APB1PERIPH_TIMER4            RCC_APB1CCR_TIMER4EN
#define  RCC_APB1PERIPH_TIMER5            RCC_APB1CCR_TIMER5EN
#define  RCC_APB1PERIPH_TIMER6            RCC_APB1CCR_TIMER6EN
#define  RCC_APB1PERIPH_TIMER7            RCC_APB1CCR_TIMER7EN
#define  RCC_APB1PERIPH_TIMER12           RCC_APB1CCR_TIMER12EN
#define  RCC_APB1PERIPH_TIMER13           RCC_APB1CCR_TIMER13EN
#define  RCC_APB1PERIPH_TIMER14           RCC_APB1CCR_TIMER14EN
#define  RCC_APB1PERIPH_WWDG              RCC_APB1CCR_WWDGEN
#define  RCC_APB1PERIPH_SPI2              RCC_APB1CCR_SPI2EN
#define  RCC_APB1PERIPH_SPI3              RCC_APB1CCR_SPI3EN
#define  RCC_APB1PERIPH_USART2            RCC_APB1CCR_USART2EN
#define  RCC_APB1PERIPH_USART3            RCC_APB1CCR_USART3EN
#define  RCC_APB1PERIPH_UART4             RCC_APB1CCR_UART4EN
#define  RCC_APB1PERIPH_UART5             RCC_APB1CCR_UART5EN
#define  RCC_APB1PERIPH_I2C1              RCC_APB1CCR_I2C1EN
#define  RCC_APB1PERIPH_I2C2              RCC_APB1CCR_I2C2EN
#define  RCC_APB1PERIPH_USB               RCC_APB1CCR_USBEN
#define  RCC_APB1PERIPH_CAN1              RCC_APB1CCR_CAN1EN
#define  RCC_APB1PERIPH_CAN2              RCC_APB1CCR_CAN2EN
#define  RCC_APB1PERIPH_BKP               RCC_APB1CCR_BKPEN
#define  RCC_APB1PERIPH_PWR               RCC_APB1CCR_PWREN
#define  RCC_APB1PERIPH_DAC               RCC_APB1CCR_DACEN

/**
  * @}
  */

/** @defgroup RCC_APB1_Peripherals_RST 
  * @{
  */
#define  RCC_APB1PERIPH_TIMER2RST         RCC_APB1RCR_TIMER2RST
#define  RCC_APB1PERIPH_TIMER3RST         RCC_APB1RCR_TIMER3RST
#define  RCC_APB1PERIPH_TIMER4RST         RCC_APB1RCR_TIMER4RST
#define  RCC_APB1PERIPH_TIMER5RST         RCC_APB1RCR_TIMER5RST
#define  RCC_APB1PERIPH_TIMER6RST         RCC_APB1RCR_TIMER6RST
#define  RCC_APB1PERIPH_TIMER7RST         RCC_APB1RCR_TIMER7RST
#define  RCC_APB1PERIPH_TIMER12RST        RCC_APB1RCR_TIMER12RST 
#define  RCC_APB1PERIPH_TIMER13RST        RCC_APB1RCR_TIMER13RST
#define  RCC_APB1PERIPH_TIMER14RST        RCC_APB1RCR_TIMER14RST 
#define  RCC_APB1PERIPH_WWDGRST           RCC_APB1RCR_WWDGRST
#define  RCC_APB1PERIPH_SPI2RST           RCC_APB1RCR_SPI2RST
#define  RCC_APB1PERIPH_SPI3RST           RCC_APB1RCR_SPI3RST
#define  RCC_APB1PERIPH_USART2RST         RCC_APB1RCR_USART2RST   
#define  RCC_APB1PERIPH_USART3RST         RCC_APB1RCR_USART3RST   
#define  RCC_APB1PERIPH_UART4RST          RCC_APB1RCR_UART4RST   
#define  RCC_APB1PERIPH_UART5RST          RCC_APB1RCR_UART5RST   
#define  RCC_APB1PERIPH_I2C1RST           RCC_APB1RCR_I2C1RST    
#define  RCC_APB1PERIPH_I2C2RST           RCC_APB1RCR_I2C2RST
#define  RCC_APB1PERIPH_USBRST            RCC_APB1RCR_USBRST 
#define  RCC_APB1PERIPH_CAN1RST           RCC_APB1RCR_CAN1RST  
#define  RCC_APB1PERIPH_CAN2RST           RCC_APB1RCR_CAN2RST   
#define  RCC_APB1PERIPH_BKPRST            RCC_APB1RCR_BKPRST    
#define  RCC_APB1PERIPH_PWRRST            RCC_APB1RCR_PWRRST    
#define  RCC_APB1PERIPH_DACRST            RCC_APB1RCR_DACRST    

/**
  * @}
  */

/** @defgroup RCC_AHB2_peripheral 
  * @{
  */
/*GD32F20x*/
#define  RCC_AHB2PERIPH_DCI                   ((uint32_t)0x00000001)             
#define  RCC_AHB2PERIPH_CAU                   ((uint32_t)0x00000010)            
#define  RCC_AHB2PERIPH_HAU                   ((uint32_t)0x00000020)            
#define  RCC_AHB2PERIPH_RNG                   ((uint32_t)0x00000040)  

/**
  * @}
  */

