LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_rcc.h
/** @defgroup RCC_AHB2_Peripherals_RST 
  * @{
  */
/*GD32F20x*/
#define  RCC_AHB2PERIPH_DCIRST                ((uint32_t)0x00000001)             
#define  RCC_AHB2PERIPH_CAURST                ((uint32_t)0x00000010)            
#define  RCC_AHB2PERIPH_HAURST                ((uint32_t)0x00000020)            
#define  RCC_AHB2PERIPH_RNGRST                ((uint32_t)0x00000040)  

/**
  * @}
  */

/** @defgroup RCC_APB2_peripheral2 
  * @{
  */
/*GD32F20x*/
#define  RCC_APB2PERIPH2_USART6               ((uint32_t)0x01000000)            
#define  RCC_APB2PERIPH2_TLDI                 ((uint32_t)0x04000000)            
#define  RCC_APB2PERIPH2_GPIOH                ((uint32_t)0x40000000)           
#define  RCC_APB2PERIPH2_GPIOI                ((uint32_t)0x80000000)           

/**
  * @}
  */

/** @defgroup RCC_APB2_Peripherals2_RST 
  * @{
  */
/*GD32F20x*/
#define  RCC_APB2PERIPH2_USART6RST            ((uint32_t)0x01000000)            
#define  RCC_APB2PERIPH2_TLDIRST              ((uint32_t)0x04000000)            
#define  RCC_APB2PERIPH2_GPIOHRST             ((uint32_t)0x40000000)           
#define  RCC_APB2PERIPH2_GPIOIRST             ((uint32_t)0x80000000)           

/**
  * @}
  */

/** @defgroup RCC_APB1_peripheral2 
  * @{
  */
/*GD32F20x*/
#define  RCC_APB1PERIPH2_I2C3                 ((uint32_t)0x00800000)            
#define  RCC_APB1PERIPH2_UART7                ((uint32_t)0x40000000)            
#define  RCC_APB1PERIPH2_UART8                ((uint32_t)0x80000000)            

/**
  * @}
  */

/** @defgroup RCC_APB1_Peripherals2_RST 
  * @{
  */
/*GD32F20x*/
#define  RCC_APB1PERIPH2_I2C3RST              ((uint32_t)0x00800000)            
#define  RCC_APB1PERIPH2_UART7RST             ((uint32_t)0x40000000)            
#define  RCC_APB1PERIPH2_UART8RST             ((uint32_t)0x80000000)            

/**
  * @}
  */

/** @defgroup RCC_Flag 
  * @{
  */
/* The flag to check is in GCCR register */
#define RCC_FLAG_HSISTB                  ((uint8_t)0x21)
#define RCC_FLAG_HSESTB                  ((uint8_t)0x31)
#define RCC_FLAG_PLLSTB                  ((uint8_t)0x39)

/* The flag to check is in BDCR register */
#define RCC_FLAG_LSESTB                  ((uint8_t)0x41)

/* The flag to check is in GCSR register */
#define RCC_FLAG_LSISTB                  ((uint8_t)0x61)

#define RCC_FLAG_EPRST                   ((uint8_t)0x7A)
#define RCC_FLAG_POPDRST                 ((uint8_t)0x7B)
#define RCC_FLAG_SWRRST                  ((uint8_t)0x7C)
#define RCC_FLAG_IWDGRST                 ((uint8_t)0x7D)
#define RCC_FLAG_WWDGRST                 ((uint8_t)0x7E)
#define RCC_FLAG_LPRRST                  ((uint8_t)0x7F)

/*GD32F20x*/
#define RCC_FLAG_PLLTSTB                 ((uint8_t)0x9D)

/* The flag to check is in GCCR register */
#define RCC_FLAG_PLL2STB                 ((uint8_t)0x3B)
#define RCC_FLAG_PLL3STB                 ((uint8_t)0x3D)

/**
  * @}
  */


/** @defgroup Clock_source_to_output_on_CKOUT2_pin 
  * @{
  */

#define RCC_CKOUT2SRC_NOCLOCK                  ((uint32_t)0x00000000)
#define RCC_CKOUT2SRC_SYSCLK                   ((uint32_t)0x00040000)
#define RCC_CKOUT2SRC_HSI                      ((uint32_t)0x00050000)
#define RCC_CKOUT2SRC_HSE                      ((uint32_t)0x00060000)
#define RCC_CKOUT2SRC_PLLCLK_DIV2              ((uint32_t)0x00070000)
#define RCC_CKOUT2SRC_PLL2CLK                  ((uint32_t)0x00080000)
#define RCC_CKOUT2SRC_PLL3CLK_DIV2             ((uint32_t)0x00090000)
#define RCC_CKOUT2SRC_XT1                      ((uint32_t)0x000A0000)
#define RCC_CKOUT2SRC_PLL3CLK                  ((uint32_t)0x000B0000)

#define  RCC_CKOUT2DIV1                   ((uint32_t)0x00000000)        /*!< CKOUT2 clock divided by 1 */
#define  RCC_CKOUT2DIV2                   ((uint32_t)0x00000100)        /*!< CKOUT2 clock divided by 2 */
#define  RCC_CKOUT2DIV3                   ((uint32_t)0x00000200)        /*!< CKOUT2 clock divided by 3 */
#define  RCC_CKOUT2DIV4                   ((uint32_t)0x00000300)        /*!< CKOUT2 clock divided by 4 */
#define  RCC_CKOUT2DIV5                   ((uint32_t)0x00000400)        /*!< CKOUT2 clock divided by 5 */
#define  RCC_CKOUT2DIV6                   ((uint32_t)0x00000500)        /*!< CKOUT2 clock divided by 6 */
#define  RCC_CKOUT2DIV7                   ((uint32_t)0x00000600)        /*!< CKOUT2 clock divided by 7 */
#define  RCC_CKOUT2DIV8                   ((uint32_t)0x00000700)        /*!< CKOUT2 clock divided by 8 */
#define  RCC_CKOUT2DIV9                   ((uint32_t)0x00000800)        /*!< CKOUT2 clock divided by 9 */
#define  RCC_CKOUT2DIV10                  ((uint32_t)0x00000900)        /*!< CKOUT2 clock divided by 10 */
#define  RCC_CKOUT2DIV11                  ((uint32_t)0x00000A00)        /*!< CKOUT2 clock divided by 11 */
#define  RCC_CKOUT2DIV12                  ((uint32_t)0x00000B00)        /*!< CKOUT2 clock divided by 12 */
#define  RCC_CKOUT2DIV13                  ((uint32_t)0x00000C00)        /*!< CKOUT2 clock divided by 13 */
#define  RCC_CKOUT2DIV14                  ((uint32_t)0x00000D00)        /*!< CKOUT2 clock divided by 14 */
#define  RCC_CKOUT2DIV15                  ((uint32_t)0x00000E00)        /*!< CKOUT2 clock divided by 15 */
#define  RCC_CKOUT2DIV16                  ((uint32_t)0x00000F00)        /*!< CKOUT2 clock divided by 16 */
#define  RCC_CKOUT2DIV17                  ((uint32_t)0x00001000)        /*!< CKOUT2 clock divided by 17 */
#define  RCC_CKOUT2DIV18                  ((uint32_t)0x00001100)        /*!< CKOUT2 clock divided by 18 */
#define  RCC_CKOUT2DIV19                  ((uint32_t)0x00001200)        /*!< CKOUT2 clock divided by 19 */
#define  RCC_CKOUT2DIV20                  ((uint32_t)0x00001300)        /*!< CKOUT2 clock divided by 20 */
#define  RCC_CKOUT2DIV21                  ((uint32_t)0x00001400)        /*!< CKOUT2 clock divided by 21 */
#define  RCC_CKOUT2DIV22                  ((uint32_t)0x00001500)        /*!< CKOUT2 clock divided by 22 */
#define  RCC_CKOUT2DIV23                  ((uint32_t)0x00001600)        /*!< CKOUT2 clock divided by 23 */
#define  RCC_CKOUT2DIV24                  ((uint32_t)0x00001700)        /*!< CKOUT2 clock divided by 24 */
#define  RCC_CKOUT2DIV25                  ((uint32_t)0x00001800)        /*!< CKOUT2 clock divided by 25 */
#define  RCC_CKOUT2DIV26                  ((uint32_t)0x00001900)        /*!< CKOUT2 clock divided by 26 */
#define  RCC_CKOUT2DIV27                  ((uint32_t)0x00001A00)        /*!< CKOUT2 clock divided by 27 */
#define  RCC_CKOUT2DIV28                  ((uint32_t)0x00001B00)        /*!< CKOUT2 clock divided by 28 */
#define  RCC_CKOUT2DIV29                  ((uint32_t)0x00001C00)        /*!< CKOUT2 clock divided by 29 */
#define  RCC_CKOUT2DIV30                  ((uint32_t)0x00001D00)        /*!< CKOUT2 clock divided by 30 */
#define  RCC_CKOUT2DIV31                  ((uint32_t)0x00001E00)        /*!< CKOUT2 clock divided by 31 */
#define  RCC_CKOUT2DIV32                  ((uint32_t)0x00001F00)        /*!< CKOUT2 clock divided by 32 */
#define  RCC_CKOUT2DIV33                  ((uint32_t)0x00002000)        /*!< CKOUT2 clock divided by 33 */
#define  RCC_CKOUT2DIV34                  ((uint32_t)0x00002100)        /*!< CKOUT2 clock divided by 34 */
#define  RCC_CKOUT2DIV35                  ((uint32_t)0x00002200)        /*!< CKOUT2 clock divided by 35 */
#define  RCC_CKOUT2DIV36                  ((uint32_t)0x00002300)        /*!< CKOUT2 clock divided by 36 */
#define  RCC_CKOUT2DIV37                  ((uint32_t)0x00002400)        /*!< CKOUT2 clock divided by 37 */
#define  RCC_CKOUT2DIV38                  ((uint32_t)0x00002500)        /*!< CKOUT2 clock divided by 38 */
#define  RCC_CKOUT2DIV39                  ((uint32_t)0x00002600)        /*!< CKOUT2 clock divided by 39 */
#define  RCC_CKOUT2DIV40                  ((uint32_t)0x00002700)        /*!< CKOUT2 clock divided by 40 */
#define  RCC_CKOUT2DIV41                  ((uint32_t)0x00002800)        /*!< CKOUT2 clock divided by 41 */
#define  RCC_CKOUT2DIV42                  ((uint32_t)0x00002900)        /*!< CKOUT2 clock divided by 42 */
#define  RCC_CKOUT2DIV43                  ((uint32_t)0x00002A00)        /*!< CKOUT2 clock divided by 43 */
#define  RCC_CKOUT2DIV44                  ((uint32_t)0x00002B00)        /*!< CKOUT2 clock divided by 44 */
#define  RCC_CKOUT2DIV45                  ((uint32_t)0x00002C00)        /*!< CKOUT2 clock divided by 45 */
#define  RCC_CKOUT2DIV46                  ((uint32_t)0x00002D00)        /*!< CKOUT2 clock divided by 46 */
#define  RCC_CKOUT2DIV47                  ((uint32_t)0x00002E00)        /*!< CKOUT2 clock divided by 47 */
#define  RCC_CKOUT2DIV48                  ((uint32_t)0x00002F00)        /*!< CKOUT2 clock divided by 48 */
#define  RCC_CKOUT2DIV49                  ((uint32_t)0x00003000)        /*!< CKOUT2 clock divided by 49 */
#define  RCC_CKOUT2DIV50                  ((uint32_t)0x00003100)        /*!< CKOUT2 clock divided by 50 */
#define  RCC_CKOUT2DIV51                  ((uint32_t)0x00003200)        /*!< CKOUT2 clock divided by 51 */
#define  RCC_CKOUT2DIV52                  ((uint32_t)0x00003300)        /*!< CKOUT2 clock divided by 52 */
#define  RCC_CKOUT2DIV53                  ((uint32_t)0x00003400)        /*!< CKOUT2 clock divided by 53 */
#define  RCC_CKOUT2DIV54                  ((uint32_t)0x00003500)        /*!< CKOUT2 clock divided by 54 */
#define  RCC_CKOUT2DIV55                  ((uint32_t)0x00003600)        /*!< CKOUT2 clock divided by 55 */
#define  RCC_CKOUT2DIV56                  ((uint32_t)0x00003700)        /*!< CKOUT2 clock divided by 56 */
#define  RCC_CKOUT2DIV57                  ((uint32_t)0x00003800)        /*!< CKOUT2 clock divided by 57 */
#define  RCC_CKOUT2DIV58                  ((uint32_t)0x00003900)        /*!< CKOUT2 clock divided by 58 */
#define  RCC_CKOUT2DIV59                  ((uint32_t)0x00003A00)        /*!< CKOUT2 clock divided by 59 */
#define  RCC_CKOUT2DIV60                  ((uint32_t)0x00003B00)        /*!< CKOUT2 clock divided by 60 */
#define  RCC_CKOUT2DIV61                  ((uint32_t)0x00003C00)        /*!< CKOUT2 clock divided by 61 */
#define  RCC_CKOUT2DIV62                  ((uint32_t)0x00003D00)        /*!< CKOUT2 clock divided by 62 */
#define  RCC_CKOUT2DIV63                  ((uint32_t)0x00003E00)        /*!< CKOUT2 clock divided by 63 */
#define  RCC_CKOUT2DIV64                  ((uint32_t)0x00003F00)        /*!< CKOUT2 clock divided by 64 */
/**
  * @}
  */

