LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_rcc.h
/** @defgroup Clock_source_to_output_on_CKOUT_pin 
  * @{
  */
#define  RCC_CKOUTDIV1                   ((uint32_t)0x00000000)        /*!< CKOUT clock divided by 1 */
#define  RCC_CKOUTDIV2                   ((uint32_t)0x00000001)        /*!< CKOUT clock divided by 2 */
#define  RCC_CKOUTDIV3                   ((uint32_t)0x00000002)        /*!< CKOUT clock divided by 3 */
#define  RCC_CKOUTDIV4                   ((uint32_t)0x00000003)        /*!< CKOUT clock divided by 4 */
#define  RCC_CKOUTDIV5                   ((uint32_t)0x00000004)        /*!< CKOUT clock divided by 5 */
#define  RCC_CKOUTDIV6                   ((uint32_t)0x00000005)        /*!< CKOUT clock divided by 6 */
#define  RCC_CKOUTDIV7                   ((uint32_t)0x00000006)        /*!< CKOUT clock divided by 7 */
#define  RCC_CKOUTDIV8                   ((uint32_t)0x00000007)        /*!< CKOUT clock divided by 8 */
#define  RCC_CKOUTDIV9                   ((uint32_t)0x00000008)        /*!< CKOUT clock divided by 9 */
#define  RCC_CKOUTDIV10                  ((uint32_t)0x00000009)        /*!< CKOUT clock divided by 10 */
#define  RCC_CKOUTDIV11                  ((uint32_t)0x0000000A)        /*!< CKOUT clock divided by 11 */
#define  RCC_CKOUTDIV12                  ((uint32_t)0x0000000B)        /*!< CKOUT clock divided by 12 */
#define  RCC_CKOUTDIV13                  ((uint32_t)0x0000000C)        /*!< CKOUT clock divided by 13 */
#define  RCC_CKOUTDIV14                  ((uint32_t)0x0000000D)        /*!< CKOUT clock divided by 14 */
#define  RCC_CKOUTDIV15                  ((uint32_t)0x0000000E)        /*!< CKOUT clock divided by 15 */
#define  RCC_CKOUTDIV16                  ((uint32_t)0x0000000F)        /*!< CKOUT clock divided by 16 */
#define  RCC_CKOUTDIV17                  ((uint32_t)0x00000010)        /*!< CKOUT clock divided by 17 */
#define  RCC_CKOUTDIV18                  ((uint32_t)0x00000011)        /*!< CKOUT clock divided by 18 */
#define  RCC_CKOUTDIV19                  ((uint32_t)0x00000012)        /*!< CKOUT clock divided by 19 */
#define  RCC_CKOUTDIV20                  ((uint32_t)0x00000013)        /*!< CKOUT clock divided by 20 */
#define  RCC_CKOUTDIV21                  ((uint32_t)0x00000014)        /*!< CKOUT clock divided by 21 */
#define  RCC_CKOUTDIV22                  ((uint32_t)0x00000015)        /*!< CKOUT clock divided by 22 */
#define  RCC_CKOUTDIV23                  ((uint32_t)0x00000016)        /*!< CKOUT clock divided by 23 */
#define  RCC_CKOUTDIV24                  ((uint32_t)0x00000017)        /*!< CKOUT clock divided by 24 */
#define  RCC_CKOUTDIV25                  ((uint32_t)0x00000018)        /*!< CKOUT clock divided by 25 */
#define  RCC_CKOUTDIV26                  ((uint32_t)0x00000019)        /*!< CKOUT clock divided by 26 */
#define  RCC_CKOUTDIV27                  ((uint32_t)0x0000001A)        /*!< CKOUT clock divided by 27 */
#define  RCC_CKOUTDIV28                  ((uint32_t)0x0000001B)        /*!< CKOUT clock divided by 28 */
#define  RCC_CKOUTDIV29                  ((uint32_t)0x0000001C)        /*!< CKOUT clock divided by 29 */
#define  RCC_CKOUTDIV30                  ((uint32_t)0x0000001D)        /*!< CKOUT clock divided by 30 */
#define  RCC_CKOUTDIV31                  ((uint32_t)0x0000001E)        /*!< CKOUT clock divided by 31 */
#define  RCC_CKOUTDIV32                  ((uint32_t)0x0000001F)        /*!< CKOUT clock divided by 32 */
#define  RCC_CKOUTDIV33                  ((uint32_t)0x00000020)        /*!< CKOUT clock divided by 33 */
#define  RCC_CKOUTDIV34                  ((uint32_t)0x00000021)        /*!< CKOUT clock divided by 34 */
#define  RCC_CKOUTDIV35                  ((uint32_t)0x00000022)        /*!< CKOUT clock divided by 35 */
#define  RCC_CKOUTDIV36                  ((uint32_t)0x00000023)        /*!< CKOUT clock divided by 36 */
#define  RCC_CKOUTDIV37                  ((uint32_t)0x00000024)        /*!< CKOUT clock divided by 37 */
#define  RCC_CKOUTDIV38                  ((uint32_t)0x00000025)        /*!< CKOUT clock divided by 38 */
#define  RCC_CKOUTDIV39                  ((uint32_t)0x00000026)        /*!< CKOUT clock divided by 39 */
#define  RCC_CKOUTDIV40                  ((uint32_t)0x00000027)        /*!< CKOUT clock divided by 40 */
#define  RCC_CKOUTDIV41                  ((uint32_t)0x00000028)        /*!< CKOUT clock divided by 41 */
#define  RCC_CKOUTDIV42                  ((uint32_t)0x00000029)        /*!< CKOUT clock divided by 42 */
#define  RCC_CKOUTDIV43                  ((uint32_t)0x0000002A)        /*!< CKOUT clock divided by 43 */
#define  RCC_CKOUTDIV44                  ((uint32_t)0x0000002B)        /*!< CKOUT clock divided by 44 */
#define  RCC_CKOUTDIV45                  ((uint32_t)0x0000002C)        /*!< CKOUT clock divided by 45 */
#define  RCC_CKOUTDIV46                  ((uint32_t)0x0000002D)        /*!< CKOUT clock divided by 46 */
#define  RCC_CKOUTDIV47                  ((uint32_t)0x0000002E)        /*!< CKOUT clock divided by 47 */
#define  RCC_CKOUTDIV48                  ((uint32_t)0x0000002F)        /*!< CKOUT clock divided by 48 */
#define  RCC_CKOUTDIV49                  ((uint32_t)0x00000030)        /*!< CKOUT clock divided by 49 */
#define  RCC_CKOUTDIV50                  ((uint32_t)0x00000031)        /*!< CKOUT clock divided by 50 */
#define  RCC_CKOUTDIV51                  ((uint32_t)0x00000032)        /*!< CKOUT clock divided by 51 */
#define  RCC_CKOUTDIV52                  ((uint32_t)0x00000033)        /*!< CKOUT clock divided by 52 */
#define  RCC_CKOUTDIV53                  ((uint32_t)0x00000034)        /*!< CKOUT clock divided by 53 */
#define  RCC_CKOUTDIV54                  ((uint32_t)0x00000035)        /*!< CKOUT clock divided by 54 */
#define  RCC_CKOUTDIV55                  ((uint32_t)0x00000036)        /*!< CKOUT clock divided by 55 */
#define  RCC_CKOUTDIV56                  ((uint32_t)0x00000037)        /*!< CKOUT clock divided by 56 */
#define  RCC_CKOUTDIV57                  ((uint32_t)0x00000038)        /*!< CKOUT clock divided by 57 */
#define  RCC_CKOUTDIV58                  ((uint32_t)0x00000039)        /*!< CKOUT clock divided by 58 */
#define  RCC_CKOUTDIV59                  ((uint32_t)0x0000003A)        /*!< CKOUT clock divided by 59 */
#define  RCC_CKOUTDIV60                  ((uint32_t)0x0000003B)        /*!< CKOUT clock divided by 60 */
#define  RCC_CKOUTDIV61                  ((uint32_t)0x0000003C)        /*!< CKOUT clock divided by 61 */
#define  RCC_CKOUTDIV62                  ((uint32_t)0x0000003D)        /*!< CKOUT clock divided by 62 */
#define  RCC_CKOUTDIV63                  ((uint32_t)0x0000003E)        /*!< CKOUT clock divided by 63 */
#define  RCC_CKOUTDIV64                  ((uint32_t)0x0000003F)        /*!< CKOUT clock divided by 64 */
/**
  * @}
  */

/** @defgroup RCC_PLLT_clock_source 
  * @{
  */
#define  RCC_PLLTCLKSOURCE_HSI           ((uint32_t)0x00000000)        /*!< HSI selected as PLLT clock */
#define  RCC_PLLTCLKSOURCE_HSE           ((uint32_t)0x80000000)        /*!< HSE selected as PLLT clock */

/**
  * @}
  */

