LiteOS/LiteOS/GD32F207_Library/FWLib/inc/gd32f20x_rcc.h
/** @defgroup TCDI prescaler selection 
  * @{
  */

#define  RCC_PLLT_TLDIPS_DIV2            ((uint32_t)0x00000000)        /*!< TLDI clock = PLLT_R/2 */
#define  RCC_PLLT_TLDIPS_DIV4            ((uint32_t)0x00010000)        /*!< TLDI clock = PLLT_R/4 */
#define  RCC_PLLT_TLDIPS_DIV8            ((uint32_t)0x00020000)        /*!< TLDI clock = PLLT_R/8 */
#define  RCC_PLLT_TLDIPS_DIV16           ((uint32_t)0x00030000)        /*!< TCDI clock = PLLT_R/16 */

/**
  * @}
  */

/**
  * @}
  */
  
/** @defgroup RCC_Exported_Functions
  * @{
  */
/* Reset the RCC clock configuration to the default reset state */

void RCC_DeInit(void);

/* Internal/external clocks, PLL, CKM and CK_OUT configuration functions */

void RCC_HSEConfig(uint32_t RCC_HSE);
TypeState RCC_WaitForHSEStartUp(void);
void RCC_AdjustHSICalibrationValue(uint8_t HSICalibrationValue);
void RCC_HSI_Enable(TypeState NewValue);
void RCC_PLLConfig(uint32_t RCC_PLLSelect, uint32_t RCC_PLLMF);
void RCC_PLL_Enable(TypeState NewValue);
void RCC_LSEConfig(uint32_t RCC_LSE);
void RCC_LSEDRVConfig(uint32_t RCC_LSEDRV);
void RCC_LSI_Enable(TypeState NewValue);
void RCC_HSEClockMonitor_Enable(TypeState NewValue);
void RCC_CKOUTSELConfig(uint32_t RCC_CKOUTSRC, uint32_t RCC_CKOUTDIVx);
void RCC_CKOUT2SELConfig(uint32_t RCC_CKOUT2SRC, uint32_t RCC_CKOUT2DIVx);
void RCC_PREDV1Config(uint32_t RCC_PREDV1_Source, uint32_t RCC_PREDV1_Div);
void RCC_PREDV2Config(uint32_t RCC_PREDV2_Div);
void RCC_PLL2Config(uint32_t RCC_PLL2MF);
void RCC_PLL2_Enable(TypeState NewValue);
void RCC_PLL3Config(uint32_t RCC_PLL3MF);
void RCC_PLL3_Enable(TypeState NewValue);

/* System, AHB, APB1 and APB2 busses clocks configuration functions */

void RCC_CK_SYSConfig(uint32_t RCC_SYSCLKSource);
uint8_t RCC_GetCK_SYSSource(void);
void RCC_AHBConfig(uint32_t RCC_CK_SYSDiv);
void RCC_APB1Config(uint32_t RCC_APB1);
void RCC_APB2Config(uint32_t RCC_APB2);

void RCC_OTGFSCLKConfig(uint32_t RCC_OTGFSCLK);

void RCC_ADCCLKConfig(uint32_t RCC_ADCCLK);

void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLK);                                  
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLK);

void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource);
void RCC_GetClocksFreq(RCC_ClocksPara* RCC_Clocks);

/* Peripheral clocks configuration functions */

void RCC_AHBPeriphClock_Enable(uint32_t RCC_AHBPeriph, TypeState NewValue);
void RCC_APB2PeriphClock_Enable(uint32_t RCC_APB2Periph, TypeState NewValue);
void RCC_APB1PeriphClock_Enable(uint32_t RCC_APB1Periph, TypeState NewValue);
void RCC_RTCCLK_Enable(TypeState NewValue);

void RCC_AHBPeriphReset_Enable(uint32_t RCC_AHBPeriphRST, TypeState NewValue);

void RCC_APB2PeriphReset_Enable(uint32_t RCC_APB2PeriphRST, TypeState NewValue);
void RCC_APB1PeriphReset_Enable(uint32_t RCC_APB1PeriphRST, TypeState NewValue);
void RCC_BackupReset_Enable(TypeState NewValue);

/* Interrupts and flags management functions */

void RCC_INTConfig(uint32_t RCC_INT, TypeState NewValue);
TypeState RCC_GetIntBitState(uint32_t RCC_INT);
void RCC_ClearIntBitState(uint32_t RCC_INT);
TypeState RCC_GetBitState(uint8_t RCC_FLAG);
void RCC_ClearBitState(void);

void RCC_KERNELVOLConfig(uint32_t RCC_KERNEL_VOL);

/* Peripheral clocks configuration functions */

void RCC_AHB2PeriphClock_Enable(uint32_t RCC_AHB2Periph, TypeState NewValue);
void RCC_APB2Periph2Clock_Enable(uint32_t RCC_APB2Periph2, TypeState NewValue);
void RCC_APB1Periph2Clock_Enable(uint32_t RCC_APB1Periph2, TypeState NewValue);

void RCC_AHB2PeriphReset_Enable(uint32_t RCC_AHB2PeriphRST, TypeState NewValue);
void RCC_APB2Periph2Reset_Enable(uint32_t RCC_APB2Periph2RST, TypeState NewValue);
void RCC_APB1Periph2Reset_Enable(uint32_t RCC_APB1Periph2RST, TypeState NewValue);

void RCC_PLLT_Enable(TypeState NewValue);
void RCC_PLLTCLKConfig(uint32_t RCC_PLLTCLKSource);
void RCC_PLLTVCOConfig(uint32_t PLLTPS, uint32_t PLLTMF, uint32_t PLLTRPS);
void RCC_TLDICLKDivConfig(uint32_t RCC_PLLT_TLDIPS_Divx);

#ifdef __cplusplus
}
#endif

#endif /* __GD32F20x_RCC_H */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/
